# Python_homework_1

# Task_1
# Создать две переменные first=10, second=30. Вывести на экран построчно результат математического
# взаимодействия (+, -, *, /, **) для этих чисел.

first = 10
second = 30

print('result_task_1:')

print(first + second)

print(first - second)

print(first * second)

print(first / second)

print(first ** second)

# Task_2
# Разобраться как работают операторы % и //. Вывести на экран эти операции для переменных из пункта 2.

print('\n result_task_2:')

# % - Деление по модулю (остаток от деления). Выполняет деление и возвращает значение остатка.

print(first % second)

# // - Деление без остатка. Выполняет деление и возвращает целочисленное значение частного, убирая цифры после
# десятичной точки.

print(first // second)
